---
## Assignment Instructions

Langkah - langkah sebelum mengerjakan : 
* Gunakan dataset dari URL [ini](https://github.com/danupurnomo/hacktiv8-exercises/blob/main/P0W2D4AM%20%26%20P0W2D4PM%20-%20SQL/P0W2D4AM%20%26%20P0W2D4PM%20-%20SQL.ipynb).
* Buatlah table `teachers` dan `courses`. Masukkan semua data pada masing-masing table.
* Table `teachers` akan memiliki 15 data.
* Table `courses` akan memiliki 20 data.

Soal : Carilah dosen yang memiliki gaji tertinggi per masing-masing mata kuliah. Tampilkan semua atribut dosen dan semua atribut mata kuliahnya. Urutkan hasilnya berdasarkan nama mata kuliahnya secara ascending (A-Z).

Hasil output yang diharapkan : 
<img src="https://i.ibb.co/gM4QpXj/Phase-0-Output-NGC-9.png">

---

## Jawaban

Buat tabel untuk memasukkan dataset `teachers` dan `courses` sesuai dengan syarat yang diminta. Untuk pembuatan tabel (dan keseluruhan pengerjaan soal ini) akan menggunakan SQL:

-- Menyiapkan tabel `teachers` untuk diisi:

    CREATE TABLE teachers (
        id INT NOT NULL PRIMARY KEY AUTO_INCREMENT,
        first_name varchar(25) NOT NULL,
        last_name varchar(50),
        school varchar(50) NOT NULL,
        hire_date date,
        salary numeric
        );

-- Mengisi tabel `teachers`:

    INSERT INTO teachers (id,first_name, last_name, school, hire_date, salary)
        VALUES (1,'Janet', 'Smith', 'MIT', '2011-10-30', 36200),
            (2,'Lee', 'Reynolds', 'MIT', '1993-05-22', 65000),
            (3,'Samuel', 'Cole', 'Cambridge University', '2005-08-01', 43500),
            (4,'Samantha', 'Bush', 'Cambridge University', '2011-10-30', 36200),
            (5,'Betty', 'Diaz', 'Cambridge University', '2005-08-30', 43500),
            (6,'Kathleen', 'Roush', 'MIT', '2010-10-22', 38500),
            (7,'James', 'Diaz', 'Harvard University', '2003-07-18', 61000),
            (8,'Zack', 'Smith', 'Harvard University', '2000-12-29', 55500),
            (9,'Luis', 'Gonzales', 'Standford University', '2002-12-01', 50000),
            (10,'Frank', 'Abbers', 'Standford University', '1999-01-30', 66000);

-- Menambahkan isi dari tabel `teachers`:

    INSERT INTO teachers (first_name, last_name, school, hire_date, salary)
        VALUES ('Samuel', 'Abbers', 'Standford University', '2006-01-30', 32000),
            ('Jessica', 'Abbers', 'Standford University', '2005-01-30', 33000),
            ('Tom', 'Massi', 'Harvard University', '1999-09-09', 39500),
            ('Esteban', 'Brown', 'MIT', '2007-01-30', 36000),
            ('Carlos', 'Alonso', 'Standford University', '2001-01-30', 44000);

-- Menyiapkan tabel `courses` untuk diisi:

    CREATE TABLE courses (
        id INT NOT NULL PRIMARY KEY AUTO_INCREMENT,
        name varchar(20),
        teachers_id INT,
        total_students INT
        );

-- Mengisi tabel `courses`:

    INSERT INTO courses (name, teachers_id, total_students)
        VALUES  ('Calculus', 2, 20),
            ('Physics', 2, 10),
            ('Calculus', 1, 30),
            ('Computer Science', 1, 20),
            ('Politic', 13, 15),
            ('Algebra', 2, 10),
            ('Algebra', 13, 30),
            ('Computer Science', 10, 35),
            ('Life Science', 11, 20),
            ('Chemistry', 9, 22),
            ('Chemistry', 8, 16),
            ('Calculus', 5, 19),
            ('Politic', 4, 17),
            ('Biology', 6, 22),
            ('Physics', 3, 29),
            ('Biology', 8, 28),
            ('Calculus', 12, 34),
            ('Physics', 13, 34),
            ('Biology', 14, 25),
            ('Calculus', 15, 20);

Buat perintah SQL untuk memunculkan tabel dengan hasil yang diminta, di mana syarat yang diminta adalah:

1. Dosen dengan gaji tertinggi untuk masing-masing mata kuliah,
2. Semua atribut dosen yang bersangkutan muncul,
3. Data diurut berdasarkan mata kuliah secara alfabetis.

-- Gabungkan tabel `teachers` dan `courses`, lalu cari dosen dengan nilai `salary` terbesar, kemudian susun data yang sudah didapat secara alfabetis dengan menampilkan semua atributnya:

    SELECT *
    FROM teachers
    JOIN courses ON teachers.id = courses.teachers_id
    WHERE (courses.name, teachers.salary) IN (
        SELECT courses.name, max(teachers.salary)
        FROM teachers
        JOIN courses ON teachers.id = courses.teachers_id
        GROUP BY courses.name)
    ORDER BY courses.name ASC

* Baris yang menjorok ke dalam merupakan perintah untuk menyortir dosen dengan gaji terbesar untuk masing-masing mata kuliah yang diajarkan.